app/controllers/lines_controller.rb

SELECT * FROM `lines` WHERE (`lines`.`id` = 1)
---
  def show
    @line = Line.find(params[:id])